season = ["введите другое число", "зима", "зима", "весна", "весна", "весна", "лето", "лето", "лето", "осень", "осень",
          "осень", "зима"]
month = int(input("Введите номер месяца от 1 до 12 "))
print(f"Номер месяца {month} относится к {season[month]}")

season_dict = {1: "зима", 2: "зима", 3: "весна", 4: "весна", 5: "весна", 6: "лето", 7: "лето", 8: "лето", 9: "осень",
               10: "осень", 11: "осень", 12: "зима"}

print("Я два раза не повторяю не повторяю")
print(f"Номер месяца {month} относится к {season_dict.get(month)}")